api-definitions/openapi/examples/ReqVerifyPayment.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
  <soapenv:Header />
  <soapenv:Body>
    <nod:verifyPaymentNoticeReq>
      <idPSP>88888888888</idPSP>
      <idBrokerPSP>88888888888</idBrokerPSP>
      <idChannel>88888888888_01</idChannel>
      <password>**********</password>
      <qrCode>
        <fiscalCode>77777777777</fiscalCode>
        <noticeNumber>311111111112222222</noticeNumber>
      </qrCode>
    </nod:verifyPaymentNoticeReq>
  </soapenv:Body>
</soapenv:Envelope>