api-definitions/openapi/examples/ReqVerificaBollettino.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
  <soapenv:Header />
  <soapenv:Body>
    <nod:verificaBollettinoReq>
      <idPSP>88888888888</idPSP>
      <idBrokerPSP>88888888888</idBrokerPSP>
      <idChannel>88888888888_01</idChannel>
      <password>**********</password>
      <ccPost>012345678912</ccPost>
      <noticeNumber>311111111112222222</noticeNumber>
    </nod:verificaBollettinoReq>
  </soapenv:Body>
</soapenv:Envelope>