fdr/src/test/resources/requests/demandPaymentNotice.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <nod:demandPaymentNoticeRequest>
            <idPSP>{psp}</idPSP>
            <idBrokerPSP>{brokerPsp}</idBrokerPSP>
            <idChannel>{channel}</idChannel>
            <password>{channelPwd}</password>
            <idSoggettoServizio>{idSoggettoServizio}</idSoggettoServizio>
            <datiSpecificiServizio>{datiSpecificiServizio}</datiSpecificiServizio>
        </nod:demandPaymentNoticeRequest>
    </soapenv:Body>
</soapenv:Envelope>
