fdr/src/test/resources/requests/sendPaymentOutcome.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <nod:sendPaymentOutcomeReq>
            <idPSP>{psp}</idPSP>
            <idBrokerPSP>{brokerPsp}</idBrokerPSP>
            <idChannel>{channel}</idChannel>
            <password>{channelPwd}</password>
            {idempotencyKey}
            <paymentToken>{paymentToken}</paymentToken>
            <outcome>{outcome}</outcome>
            <!--Optional:-->
            <details>
                <paymentMethod>creditCard</paymentMethod>
                <!--Optional:-->
                <paymentChannel>app</paymentChannel>
                <fee>{fee}</fee>
                <!--Optional:-->
                <payer>
                    <uniqueIdentifier>
                        <entityUniqueIdentifierType>G</entityUniqueIdentifierType>
                        <entityUniqueIdentifierValue>77777777777_01</entityUniqueIdentifierValue>
                    </uniqueIdentifier>
                    <fullName>SPOname</fullName>
                    <!--Optional:-->
                    <streetName>SPOstreet</streetName>
                    <!--Optional:-->
                    <civicNumber>SPOcivic</civicNumber>
                    <!--Optional:-->
                    <postalCode>SPOpostal</postalCode>
                    <!--Optional:-->
                    <city>city</city>
                    <!--Optional:-->
                    <stateProvinceRegion>SPOstate</stateProvinceRegion>
                    <!--Optional:-->
                    <country>IT</country>
                    <!--Optional:-->
                    <e-mail>SPOprova@test.it</e-mail>
                </payer>
                <applicationDate>2021-12-12</applicationDate>
                <transferDate>2021-12-11</transferDate>
            </details>
        </nod:sendPaymentOutcomeReq>
    </soapenv:Body>
</soapenv:Envelope>
