src/test/resources/it/wiremock/__files/verifyPaymentNotice_ok.xml

<?xml version="1.0" encoding="UTF-8" standalone="no" ?>
<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:common="http://pagopa-api.pagopa.gov.it/xsd/common-types/v1.0.0/" xmlns:nfp="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
    <soapenv:Body>
        <nfp:verifyPaymentNoticeRes>
            <outcome>OK</outcome>
            <paymentList>
                <paymentOptionDescription>
                    <amount>100.99</amount>
                    <options>EQ</options>
                    <dueDate>2021-07-31</dueDate>
                    <paymentNote>pagamentoTest</paymentNote>
                </paymentOptionDescription>
            </paymentList>
            <paymentDescription>Pagamento di Test</paymentDescription>
            <fiscalCodePA>77777777777</fiscalCodePA>
            <companyName>companyName</companyName>
            <officeName>officeName</officeName>
        </nfp:verifyPaymentNoticeRes>
    </soapenv:Body>
</soapenv:Envelope>