fdr/src/test/resources/requests/nodoChiediCatalogoServiziV2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
<soapenv:Header/>
<soapenv:Body>
    <nod:nodoChiediCatalogoServiziV2Request>
        <identificativoPSP>{psp}</identificativoPSP>
        <identificativoIntermediarioPSP>{brokerPsp}</identificativoIntermediarioPSP>
        <identificativoCanale>{channel}</identificativoCanale>
        <password>{channelPwd}</password>
        {pa}
        {categoria}
        {commissione}
    </nod:nodoChiediCatalogoServiziV2Request>
</soapenv:Body>
</soapenv:Envelope>