fdr/src/test/resources/requests/sendPaymentOutcome_no_details.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <nod:sendPaymentOutcomeReq>
            <idPSP>{psp}</idPSP>
            <idBrokerPSP>{brokerPsp}</idBrokerPSP>
            <idChannel>{channel}</idChannel>
            <password>{channelPwd}</password>
            {idempotencyKey}
            <paymentToken>{paymentToken}</paymentToken>
            <outcome>{outcome}</outcome>
            <!--Optional:-->
<!--            <details>-->
<!--                <paymentMethod>cash</paymentMethod>-->
<!--                &lt;!&ndash;Optional:&ndash;&gt;-->
<!--&lt;!&ndash;                <paymentChannel>atm</paymentChannel>&ndash;&gt;-->
<!--                <fee>10.00</fee>-->
<!--                <payer>-->
<!--                    <uniqueIdentifier>-->
<!--                        <entityUniqueIdentifierType>F</entityUniqueIdentifierType>-->
<!--                        <entityUniqueIdentifierValue>asdlol</entityUniqueIdentifierValue>-->
<!--                    </uniqueIdentifier>-->
<!--                    <fullName>fullName</fullName>-->
<!--                    &lt;!&ndash;Optional:&ndash;&gt;-->
<!--&lt;!&ndash;                    <streetName>streetName</streetName>&ndash;&gt;-->
<!--                    &lt;!&ndash;Optional:&ndash;&gt;-->
<!--&lt;!&ndash;                    <civicNumber>civicNumber</civicNumber>&ndash;&gt;-->
<!--                    &lt;!&ndash;Optional:&ndash;&gt;-->
<!--&lt;!&ndash;                    <postalCode>postalCode</postalCode>&ndash;&gt;-->
<!--                    &lt;!&ndash;Optional:&ndash;&gt;-->
<!--&lt;!&ndash;                    <city>city</city>&ndash;&gt;-->
<!--                    &lt;!&ndash;Optional:&ndash;&gt;-->
<!--&lt;!&ndash;                    <stateProvinceRegion>stateProvinceRegion</stateProvinceRegion>&ndash;&gt;-->
<!--                    &lt;!&ndash;Optional:&ndash;&gt;-->
<!--&lt;!&ndash;                    <country>IT</country>&ndash;&gt;-->
<!--                    &lt;!&ndash;Optional:&ndash;&gt;-->
<!--&lt;!&ndash;                    <e-mail>mail@mail.it</e-mail>&ndash;&gt;-->
<!--                </payer>-->
<!--                &lt;!&ndash;Optional:&ndash;&gt;-->
<!--                <applicationDate>2021-01-01</applicationDate>-->
<!--                <transferDate>2021-01-01</transferDate>-->
<!--            </details>-->
        </nod:sendPaymentOutcomeReq>
    </soapenv:Body>
</soapenv:Envelope>